<?php

namespace App\Traits;

trait GeneralTrait
{

    /***********************************************/
    /**
     * دي ميثود عشان ترجع رساله خطا في ال اي بي اي 
     * انا هنا بمررلها رساله الخطأ  و الحاله اللي هي فولس
     * وممكن اعمل رقم للايرور بس انا مش هستخدمه 
     */
    public function returnError(/*$errNum,*/ $msg)
    {
        return response()->json([
            'status' => false,
            // 'errNum' => $errNum,
            'msg' => $msg
        ]);
    }
    /************************************************/

    /************************************************/
    /**
     * دي ميثود عشان ترجع الداتا بالطريقه الصحيحه
     * بترجع الحاله اللي هي  ترو و بترجع الرساله اللي انا بمررها 
     * و بترجع الكي اللي انا بحدده و الداتا
     */
    public function returnData($key, $value, $msg = "")
    {
        return response()->json([
            'status' => true,
            // 'errNum' => "S000",
            'msg' => $msg,
            $key => $value
        ]);
    }
    /************************************************/


    /************************************************/

    /**
     * دي عشان ترجع رساله نجاح  لو انا معملت اكشن معين مثلا
     */
    public function returnSuccessMessage($msg = ""/*, $errNum = "S000"*/)
    {
        return [
            'status' => true,
            // 'errNum' => $errNum,
            'msg' => $msg
        ];
    }
    /************************************************/






}

?>